<?php
header("Content-Type: text/html; charset=UTF-8;");
$time1 = microtime(true);
$title = '台湾巡逻艇对峙日舰 概念股闻风而动';
$content = '台湾巡逻艇对峙日舰消息刺激军工股逆市飙升。据媒体报道，台湾70多艘渔船出发保钓，渔船在巡逻艇护航下，一度逼近距离钓鱼岛只有3海里处，台湾巡逻艇更曾对峙日舰。另外钓鱼岛事件短期也有升级迹象，对于军工船舶板块形成一定正面刺激
		据悉台湾保钓船只在钓鱼岛附近与日本海上保安船只发生了直接冲突，继国内大规模反日示威和强硬保钓的立场表明之后，台湾、韩国等地区相继爆发了大规模的抗日游行。钓鱼岛争端问题有进一步加剧和扩大的迹象，受此消息刺激A股市场上的军工股闻风而动，军工概念领涨龙头中原特钢（002423）强势封上涨停，并带动以航母概念为主的军工股集体飙升。在钓鱼岛问题没有出现实质性好转和出台相关解决方法之前，中日双方在此问题上的争端和摩擦难以避免。同时中国首艘航母也即将正式服役，军工股近期有望有迎来反复表现的机会，但值得投资者注意的是，军工股反复异动主要还是市场游资的炒作行为，在市场弱势环境下，军工股的短期波动较大，参与风险较高。';
include("./AutoTag.php");
echo "标签：<pre>";
print_r(AutoTag::getTags($title, $content));
echo "\n文章所有词语:\n";
$words = AutoTag::countWords($title.'|'.$title.'|'.$content);
arsort($words);
print_r($words);
$time2 = microtime(true);
echo '花费时间(毫秒)：',($time2-$time1);